app/controllers/api/game_events_controller.rb

  def create
    # Considering there would be more work to do, we would probably use a service to handle the controller process
    # we could benefit from a GameEventService, it would enable us to reuse the logic in other controllers or jobs
    # and also to test it in isolation.

    # this logic specifically could be handled by a job, thinking of UX, it doesn't really matter to the user
    # as long as the event is created we should free the user from waiting for the response
    # but for the sake of the assignment, let's keep it simple (and also not prematurely optimize)
    @game_event = GameEvent.new(
      game_name: game_event_params[:game_name],
      event_type: game_event_params[:type],
      occurred_at: game_event_params[:occurred_at],
      # context app/controllers/application_controller.rb
      # we would have paid an unecessary database RTT to fetch the user in this case
      user_id: current_user_id
    )

    if @game_event.save
---
INSERT INTO "game_events" ("game_name", "event_type", "occurred_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["game_name", "Test Game"], ["event_type", 0], ["occurred_at", "2025-05-02 03:37:21"], ["user_id", 4], ["created_at", "2025-05-02 03:37:21.131125"], ["updated_at", "2025-05-02 03:37:21.131125"]]