app/controllers/api/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "updated_at", "email", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2025-05-02 04:06:48.091337"], ["updated_at", "2025-05-02 04:06:48.091337"], ["email", "[FILTERED]"], ["password_digest", "[FILTERED]"]]